creating a dataframe with the help of dictionary

In [62]:
import pandas as pd
import numpy as np

In [72]:
dict ={
    'col1':[1,2,3,4],
    'col2':[3,4,5,6]
}

In [73]:
df =pd.DataFrame(data =dict)

df

In [68]:
type(df)

pandas.core.frame.DataFrame

In [44]:
df.dtypes  #to check what types of data are imported

col1    int64
col2    int64
dtype: object

In [48]:
df =pd.DataFrame(data =dict,dtype=np.int8)

In [49]:
df.dtypes

col1    int8
col2    int8
dtype: object

## creating a dataframe including Series:

In [81]:
dict ={
    'col1':[1,2,3,4],
    'col2':pd.Series([2,3],index =[2,3])  #index[2and 3 me  col2 value insert kro]
}

In [84]:
 df =pd.DataFrame(data =dict,index=[1,2,3,4]) #you have to  pass index =[] then only it will not show any error

In [85]:
df

   col1  col2
1     1   NaN
2     2   2.0
3     3   3.0
4     4   NaN

## creating dataframne form numpy ndarray

In [88]:
df2 =pd.DataFrame(np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]]),columns=["a","b","c","d"])

In [89]:
df2

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [90]:
df2.T #TRANPOSE INDEX AND COLUMN  WE CAN USE df2.transpose

   0  1   2   3
a  1  5   9  13
b  2  6  10  14
c  3  7  11  15
d  4  8  12  16

##dataframe.at[] # Access a single value for a row/column pair by label.

In [91]:
df2.at[1,'b'] #6

np.int64(6)

##use of dataframe.loc[[rows],[columns]]   ##Access a group of rows and columns by label(s) or a boolean array.

In [92]:
df2.loc[0,'a']

np.int64(1)

In [95]:
df2.loc[0:3,['a','b']]

    a   b
0   1   2
1   5   6
2   9  10
3  13  14

In [102]:
df2.head()

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [104]:
df2.loc[df2['a']>1 ]

    a   b   c   d
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

## DataFrame.loc[]  uses--
1. assign value /set value
2. selecting group of rows/column
3. conditioned can be applied
4. df.loc[df['shield'] > 35] = 0
df
            max_speed  shield
cobra              30      10
viper               0       0
sidewinder          0       0